package a.test;

public class Test extends Thread {
	
	public void startImage() throws Exception {
		
		
		try {
			
			Thread.sleep(100);
		} catch (Exception e) {
			// TODO: handle exception
		}
		
		String Main[] = {
				" _____________          ////\\\\\\\\",
				"| _ _________ |         |      |",
				"||.---------.||        @  o  o  @",
				"|||         |||         |  ~   |",
				"|||         |||         \\  --  /         |\\  |",
				"|||         |||         __|  |___        | \\ |",
				"|||---------|||       //         \\      /|___|",
				"| ........... |      //           \\    / /",
				"| ||  ^^^  () |     /  /|      |\\  \\  / /",
				"|[  ]         |    /  / |      | \\  \\/ /",
				"|[  ]         |    /  / |      | \\  \\/ /",
				"| ||          |   <  <  |      |  \\   /",
				"|     _ _     |    \\   \\|  .   |   \\_/",
				"|          :::|     \\  \\|______|",
				"|-------------|         |      |",
				"|-------------|         |      |",
				"                        |  |   |"
				};
		
		for(int i=0; i<Main.length; i++) {
			
			System.out.println(Main[i]);
			
			sleep(200);
		}
		
	}
	
	
	
	public void name() throws Exception {
		
		
		try {
			
			Thread.sleep(100);
		} catch (Exception e) {
			// TODO: handle exception
		}
		
		String name[] = {
				"#################################################################################",
				"######          #####   #######           #####   #####         #####   #########",
				"###########    ######   ##########  ##  #######   ###########   #####   #########",
				"##########      #####      ####           #####      #######   ######   #########",
				"#########   ##   ####   #######################   #########   #######   #########",
				"########   ####   ###   ##############   ######   ########   ########   #########",
				"#######   ###########   ##############   ################   #########   #########",
				"#####################   ##############            ###################   #########",
				"#################################################################################",
				"                                                                                 ",
				"어서오세요~~ 현우와 성재의 부자되기위한 자판기입니다!!"
				
				};
		
		for(int i=0; i<name.length; i++) {
			
			System.out.println(name[i]);
			
			sleep(200);
		}
		
	}
	
	
	
	public void coin() throws Exception {
		
		try {
			
			//int j=0;
			
			//while(j<4) {
				
				String[] coinC = {
						
						"     ==================================",
						"     |                                |",
						"     |                                |",
						"     |               돈               |",
						"     |                                |",
						"     |                                |",
						"     ==================================",
				};
				
				for(int i=0; i<coinC.length; i++) {
					sleep(600);
					System.out.println(coinC[i]);
				//} j++;
				
				
			}
		} catch (Exception e) {
			// TODO: handle exception
		}
		
	}
	
	
	
	public void drinkCan() throws Exception {
		
		try {
			
			sleep(200);
		} catch (Exception e) {
			// TODO: handle exception
		}
		int j=0;
		
		while(j<2) {
		String[] can = {
				"     ___#________",
				"    // *       //",
				"   //    음    //",
				"  //    료  * //        떨"      ,
				" //*   수    //         어"       ,
				"//     *    //          지"        ,
				"￣￣￣￣￣￣￣          는",
				"                        중",
				"___#________            .",
				"\\\\ *       \\\\        .",
				" \\\\    음   \\\\      .",
				"  \\\\  * 료   \\\\      .",
				"   \\\\    수 * \\\\",
				"    \\\\    *    \\\\",
				"    ￣￣￣￣￣￣￣"     };

		for(int i=0; i<can.length; i++) {
	
			System.out.println(can[i]);
			} j++;
	
			sleep(600);
			}
		
	}

}
